publish/use-iframe-for-blog-demo.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-09-26 Thu 00:31 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>用 iframe 显示 HTML 例子</title>
<meta name="author" content="Spike Leung" />
<meta name="description" content="&quot;&quot;" />
<meta name="generator" content="Org Mode" />

<link rel="stylesheet" href="../styles/style.css" type="text/css"/>
<link rel="icon" href="/favicon.ico" type="image/x-icon">
</head>
<body>
<div id="preamble" class="status">

 <nav>
  <ul>
    <li><a href="/theindex.html">Home</a></li>
    <li><a href="/about.html">About</a></li>
    <li><a href="/rss.xml">RSS</a></li>
    <li><a href="https://github.com/Spike-Leung">GitHub</a></li>
  </ul>
</nav>
</div>
<div id="content" class="content">
<h1 class="title">用 iframe 显示 HTML 例子</h1>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #531ab6;">!DOCTYPE</span>&gt;
&lt;<span style="color: #721045;">html</span>&gt;
  &lt;<span style="color: #721045;">body</span>&gt;hello world&lt;/<span style="color: #721045;">body</span>&gt;
&lt;/<span style="color: #721045;">html</span>&gt;
</pre>
</div>

<iframe style="width: 100%;" srcdoc="&lt;!DOCTYPE&gt; &lt;html&gt; &lt;body&gt;hello world&lt;/body&gt; &lt;/html&gt;"></iframe>


<p>
在 <a href="https://taxodium.ink/post/weekly/1/">weekly#1</a> 中分享了一篇关于 CSS 布局的小册子: <a href="https://book.mixu.net/css/">Learn CSS Layout</a>，作者写得很好，虽然引用了很多规范，但是看起来不枯燥，反倒挺有趣，有一种醍醐灌顶的感觉。
</p>

<p>
对于用了一段时间 CSS 的人来说，是很好的学习 CSS Layout 的教程。
</p>

<p>
作者文中有很多例子，方便读者直观地看到对应的 CSS 的作用。
</p>

<p>
好奇作者是用什么写的例子，发现就是简单的 <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/iframe">&lt;iframe&gt;</a>, 然后把示例代码作为 <a href="https://developer.mozilla.org/en-US/docs/Web/HTML/Element/iframe#srcdoc">srcdoc</a> 传入。
</p>

<p>
觉得这样的形式挺简单方便的，不需要引用一些第三方的网站，适合一些简单的前端示例。
</p>

<p>
示例代码就是实际运行的代码，唯一不同就是对一些字符(如 &lt;, &gt;)进行了转义， 从而可以传入给 srcdoc。
</p>

<p>
于是我也依葫芦画瓢，在 <a href="https://taxodium.ink/post/word-break/">work-break: break-all;</a> 这篇文章使用了。
</p>

<p>
而我的博客本身使用 <a href="https://orgmode.org/">Org Mode</a> 写的，代码块是：
</p>

<pre class="example" id="org6dddf22">
#+begin_src html
&lt;!DOCTYPE&gt;
&lt;html&gt;
  &lt;body&gt;hello world&lt;/body&gt;
&lt;/html&gt;
#+end_src
</pre>

<p>
iframe 实例是：
</p>

<pre class="example" id="org47fa06d">
#+begin_export html
&lt;iframe style="width: 100%;" srcdoc="&amp;lt;!DOCTYPE&amp;gt; &amp;lt;html&amp;gt; &amp;lt;body&amp;gt;hello world&amp;lt;/body&amp;gt; &amp;lt;/html&amp;gt;"&gt;&lt;/iframe&gt;
#+end_export
</pre>

<p>
我可以编写一个 Elisp 函数，在需要生成例子的时候执行，将 <code>#+begin_src... #+end_src</code> 的代码转换成示例代码的格式：
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #000000;">(</span><span style="color: #531ab6;">defun</span> <span style="color: #721045;">spike-leung/process-next-html-src-block</span> <span style="color: #dd22dd;">()</span>
  <span style="color: #2a5045;">"Process the next HTML block from the current position, escape it, compress it, and generate a #+begin_export html block with an iframe, replacing any existing export block."</span>
  <span style="color: #dd22dd;">(</span><span style="color: #531ab6;">interactive</span><span style="color: #dd22dd;">)</span>
  <span style="color: #dd22dd;">(</span><span style="color: #531ab6;">let</span> <span style="color: #008899;">(</span>html-content escaped-html srcdoc start end export-start export-end<span style="color: #008899;">)</span>
    <span style="color: #595959;">;; </span><span style="color: #595959;">Search for the next #+begin_src html block from the current position</span>
    <span style="color: #008899;">(</span><span style="color: #531ab6;">save-excursion</span>
      <span style="color: #972500;">(</span><span style="color: #531ab6;">when</span> <span style="color: #808000;">(</span>re-search-forward <span style="color: #3548cf;">"^#</span><span style="color: #721045;">\</span><span style="color: #00663f;">\</span><span style="color: #3548cf;">+begin_src html"</span> nil t<span style="color: #808000;">)</span>
        <span style="color: #808000;">(</span><span style="color: #531ab6;">setq</span> start <span style="color: #531ab6;">(</span>match-end 0<span style="color: #531ab6;">)</span><span style="color: #808000;">)</span>
        <span style="color: #808000;">(</span><span style="color: #531ab6;">when</span> <span style="color: #531ab6;">(</span>re-search-forward <span style="color: #3548cf;">"^#</span><span style="color: #721045;">\</span><span style="color: #00663f;">\</span><span style="color: #3548cf;">+end_src"</span> nil t<span style="color: #531ab6;">)</span>
          <span style="color: #531ab6;">(</span><span style="color: #531ab6;">setq</span> end <span style="color: #008900;">(</span>match-beginning 0<span style="color: #008900;">)</span><span style="color: #531ab6;">)</span>
          <span style="color: #531ab6;">(</span><span style="color: #531ab6;">setq</span> html-content <span style="color: #008900;">(</span>buffer-substring-no-properties start end<span style="color: #008900;">)</span><span style="color: #531ab6;">)</span>
          <span style="color: #595959;">;; </span><span style="color: #595959;">Process the HTML content</span>
          <span style="color: #531ab6;">(</span><span style="color: #531ab6;">when</span> html-content
            <span style="color: #595959;">;; </span><span style="color: #595959;">Escape HTML characters using sgml-quote in a temporary buffer</span>
            <span style="color: #008900;">(</span><span style="color: #531ab6;">setq</span> escaped-html
                  <span style="color: #3548cf;">(</span><span style="color: #531ab6;">with-temp-buffer</span>
                    <span style="color: #8f0075;">(</span>insert html-content<span style="color: #8f0075;">)</span>
                    <span style="color: #8f0075;">(</span>sgml-mode<span style="color: #8f0075;">)</span> <span style="color: #595959;">;; </span><span style="color: #595959;">Switch to sgml-mode to enable sgml-quote</span>
                    <span style="color: #8f0075;">(</span>sgml-quote <span style="color: #000000;">(</span>point-min<span style="color: #000000;">)</span> <span style="color: #000000;">(</span>point-max<span style="color: #000000;">)</span><span style="color: #8f0075;">)</span>
                    <span style="color: #8f0075;">(</span>buffer-string<span style="color: #8f0075;">)</span><span style="color: #3548cf;">)</span><span style="color: #008900;">)</span>

            <span style="color: #595959;">;; </span><span style="color: #595959;">Compress into a single line and remove extra spaces</span>
            <span style="color: #008900;">(</span><span style="color: #531ab6;">setq</span> srcdoc <span style="color: #3548cf;">(</span>replace-regexp-in-string <span style="color: #3548cf;">"[</span><span style="color: #721045;">\</span><span style="color: #00663f;">n</span><span style="color: #721045;">\</span><span style="color: #00663f;">r</span><span style="color: #3548cf;">]+"</span> <span style="color: #3548cf;">" "</span> escaped-html<span style="color: #3548cf;">)</span><span style="color: #008900;">)</span>
            <span style="color: #008900;">(</span><span style="color: #531ab6;">setq</span> srcdoc <span style="color: #3548cf;">(</span>replace-regexp-in-string <span style="color: #3548cf;">"[ </span><span style="color: #721045;">\</span><span style="color: #00663f;">t</span><span style="color: #3548cf;">]+"</span> <span style="color: #3548cf;">" "</span> srcdoc<span style="color: #3548cf;">)</span><span style="color: #008900;">)</span>

            <span style="color: #595959;">;; </span><span style="color: #595959;">Move to the end of the block and check for existing export block</span>
            <span style="color: #008900;">(</span>goto-char end<span style="color: #008900;">)</span>
            <span style="color: #008900;">(</span>forward-line 1<span style="color: #008900;">)</span> <span style="color: #595959;">;; </span><span style="color: #595959;">Move to the line after #+end_src</span>

            <span style="color: #595959;">;; </span><span style="color: #595959;">Check if there's an existing #+begin_export html block</span>
            <span style="color: #008900;">(</span><span style="color: #531ab6;">when</span> <span style="color: #3548cf;">(</span>looking-at <span style="color: #3548cf;">"^#</span><span style="color: #721045;">\</span><span style="color: #00663f;">\</span><span style="color: #3548cf;">+begin_export html"</span><span style="color: #3548cf;">)</span>
              <span style="color: #3548cf;">(</span><span style="color: #531ab6;">setq</span> export-start <span style="color: #8f0075;">(</span>point<span style="color: #8f0075;">)</span><span style="color: #3548cf;">)</span>
              <span style="color: #3548cf;">(</span><span style="color: #531ab6;">when</span> <span style="color: #8f0075;">(</span>re-search-forward <span style="color: #3548cf;">"^#</span><span style="color: #721045;">\</span><span style="color: #00663f;">\</span><span style="color: #3548cf;">+end_export"</span> nil t<span style="color: #8f0075;">)</span>
                <span style="color: #8f0075;">(</span><span style="color: #531ab6;">setq</span> export-end <span style="color: #000000;">(</span>point<span style="color: #000000;">)</span><span style="color: #8f0075;">)</span>
                <span style="color: #595959;">;; </span><span style="color: #595959;">Delete the existing export block</span>
                <span style="color: #8f0075;">(</span>delete-region export-start export-end<span style="color: #8f0075;">)</span><span style="color: #3548cf;">)</span><span style="color: #008900;">)</span>

            <span style="color: #595959;">;; </span><span style="color: #595959;">Insert the new #+begin_export html block</span>
            <span style="color: #008900;">(</span>insert <span style="color: #3548cf;">(</span>format <span style="color: #3548cf;">"#+begin_export html</span><span style="color: #721045;">\</span><span style="color: #00663f;">n</span><span style="color: #3548cf;">&lt;iframe style=</span><span style="color: #721045;">\</span><span style="color: #00663f;">"</span><span style="color: #3548cf;">width:100%%</span><span style="color: #721045;">\</span><span style="color: #00663f;">"</span><span style="color: #3548cf;"> srcdoc=</span><span style="color: #721045;">\</span><span style="color: #00663f;">"</span><span style="color: #3548cf;">%s</span><span style="color: #721045;">\</span><span style="color: #00663f;">"</span><span style="color: #3548cf;">&gt;&lt;/iframe&gt;</span><span style="color: #721045;">\</span><span style="color: #00663f;">n</span><span style="color: #3548cf;">#+end_export</span><span style="color: #721045;">\</span><span style="color: #00663f;">n</span><span style="color: #3548cf;">"</span> srcdoc<span style="color: #3548cf;">)</span><span style="color: #008900;">)</span><span style="color: #531ab6;">)</span><span style="color: #808000;">)</span><span style="color: #972500;">)</span><span style="color: #008899;">)</span><span style="color: #dd22dd;">)</span><span style="color: #000000;">)</span>
</pre>
</div>

<p>
这样，我只需要编写好源码，然后执行一下函数，就能得到对应的 iframe 示例，平时写一些简单的例子时就很方便了。
</p>

<p>
对了，上面的 Elisp 代码都是 ChatGPT 写的，相关的对话在这： <a href="https://chatgpt.com/share/fd2bfa45-fbfd-492a-aa6b-6b3023f76772">https://chatgpt.com/share/fd2bfa45-fbfd-492a-aa6b-6b3023f76772</a>。
</p>
</div>
<div id="postamble" class="status">

<p class="author">Author: Spike Leung (<a href="mailto:l-yanlei@hotmail.com">l-yanlei@hotmail.com</a>)</p>
<p class="date">Date: 2024-08-05T22:21:36+08:00</p>
</div>
</body>
</html>
